---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.GetEnumerator
source: html/0c8d2586-7867-f719-a272-5c3509cae012.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.